Tekla Open API Reference for Tekla Structures 2025
ControlLine Constructor
 Creates a new control line instance.
The default values are as follows:
Line = new LineSegment();
IsMagnetic = false;
Color = ControlLineColorEnum.YELLOW;
Extension = 0.0;
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ControlLine()
Public Sub New
See Also
Reference
ControlLine Class
ControlLine Overload
Tekla.Structures.Model Namespace